export const useProductFaker = () => {
  const list =  [
    {
      id: 1,
      code: 'GG-556643',
      name: 'Гидрогелевая маска Gold & Snail, Petitfee, с улиточным муцином и коллоидным золотом, 30 мл',
      slug: '/fsdfsdf',
      image: {
        src: '/images/products/1.png'
      },
      images: [
        {
          src: '/images/products/1.png'
        },{
          src: '/images/products/2.png'
        },{
          src: '/images/products/3.png'
        },{
          src: '/images/products/4.png'
        },{
          src: '/images/products/5.png'
        },{
          src: '/images/products/6.png'
        },{
          src: '/images/products/7.png'
        }
      ],
      price: 869.50,
      oldPrice: 1001,
      rating: {
        rating: 5,
        rating_count: 19,
        reviews_count: 3,
        rating_detailes: [5,4,7,2,1]
      },
      inStock: 5,
      content: `
      <p>Гидрогелевая маска Gold & Snail от Petitfee - это инновационный уход за кожей, который сочетает в себе уникальные свойства улиточного муцина и коллоидного золота. Эта маска содержит 30 мл питательной и увлажняющей сыворотки, которая помогает улучшить тон кожи, повысить ее упругость и эластичность, а также сократить появление мелких морщин и линий.</p>
      <p>Улиточный муцин является богатым источником гиалуроновой кислоты, коллагена и эластина, которые помогают улучшить текстуру кожи, повысить ее упругость и эластичность, а также стимулировать процесс регенерации клеток. Коллоидное золото, в свою очередь, обладает антиоксидантными свойствами, защищая кожу от свободных радикалов и замедляя процесс старения.</p>
      <p>Гидрогелевая маска Gold & Snail имеет удобную форму, которая плотно прилегает к коже, обеспечивая максимальный контакт и эффективное проникновение активных компонентов в глубокие слои эпидермиса. Эта маска идеально подходит для всех типов кожи, особенно для тусклой, сухой и поврежденной кожи, которой требуется интенсивный уход и увлажнение.</p>`,
      category: {
        id: 1,
        name: "Витамины и минералы",
        slug: '/shop/fsdfsdf'
      },
      attrs: [
        {
          name: 'Форма продукта',
          value: 'капсулы'
        },{
          name: 'Количество порций',
          value: '60'
        },{
          name: 'Количество штук',
          value: '60'
        },{
          name: 'Вес нетто',
          value: '24 г'
        }
      ],
      amount: 1
    },{
      id: 2,
      name: 'Жидкий йод (йодид калия) "Liquid Iodine Plus" Life-flo, 150 мкг, 59 мл',
      slug: '/fdfsdfsdf',
      image: {
        src: '/images/products/2.png'
      },
      price: 1769.00,
      oldPrice: 890.00,
      rating: {
        rating: 3.5,
        rating_count: 19,
        reviews_count: 3,
        rating_detailes: [5,4,7,2,1]
      },
      inStock: 1,
      content: `
      <p>Гидрогелевая маска Gold & Snail от Petitfee - это инновационный уход за кожей, который сочетает в себе уникальные свойства улиточного муцина и коллоидного золота. Эта маска содержит 30 мл питательной и увлажняющей сыворотки, которая помогает улучшить тон кожи, повысить ее упругость и эластичность, а также сократить появление мелких морщин и линий.</p>
      <p>Улиточный муцин является богатым источником гиалуроновой кислоты, коллагена и эластина, которые помогают улучшить текстуру кожи, повысить ее упругость и эластичность, а также стимулировать процесс регенерации клеток. Коллоидное золото, в свою очередь, обладает антиоксидантными свойствами, защищая кожу от свободных радикалов и замедляя процесс старения.</p>
      <p>Гидрогелевая маска Gold & Snail имеет удобную форму, которая плотно прилегает к коже, обеспечивая максимальный контакт и эффективное проникновение активных компонентов в глубокие слои эпидермиса. Эта маска идеально подходит для всех типов кожи, особенно для тусклой, сухой и поврежденной кожи, которой требуется интенсивный уход и увлажнение.</p>`,
      category: {
        id: 1,
        name: "Акции",
        slug: '/shop/fsdfsdf'
      },
      amount: 2
    },{
      id: 3,
      name: 'Пророщенные зерна, Добра їжа, измельченные пророщенные зерна, 300 г',
      slug: '/fsasfa',
      image: {
        src: '/images/products/3.png'
      },
      price: 456.50,
      oldPrice: 890.00,
      rating: {
        rating: 0,
        rating_count: 19,
        reviews_count: 0,
        rating_detailes: [5,4,7,2,1]
      },
      inStock: 5,
      content: `
      <p>Гидрогелевая маска Gold & Snail от Petitfee - это инновационный уход за кожей, который сочетает в себе уникальные свойства улиточного муцина и коллоидного золота. Эта маска содержит 30 мл питательной и увлажняющей сыворотки, которая помогает улучшить тон кожи, повысить ее упругость и эластичность, а также сократить появление мелких морщин и линий.</p>
      <p>Улиточный муцин является богатым источником гиалуроновой кислоты, коллагена и эластина, которые помогают улучшить текстуру кожи, повысить ее упругость и эластичность, а также стимулировать процесс регенерации клеток. Коллоидное золото, в свою очередь, обладает антиоксидантными свойствами, защищая кожу от свободных радикалов и замедляя процесс старения.</p>
      <p>Гидрогелевая маска Gold & Snail имеет удобную форму, которая плотно прилегает к коже, обеспечивая максимальный контакт и эффективное проникновение активных компонентов в глубокие слои эпидермиса. Эта маска идеально подходит для всех типов кожи, особенно для тусклой, сухой и поврежденной кожи, которой требуется интенсивный уход и увлажнение.</p>`,
      category: {
        id: 1,
        name: "Акции",
        slug: '/shop/fsdfsdf'
      },
      amount: 1
    },{
      id: 4,
      name: 'Гидрогелевая маска Gold & Snail, Petitfee, с улиточным муцином и коллоидным золотом, 30 мл',
      slug: '/fsdfasf',
      image: {
        src: '/images/products/4.png'
      },
      price: 567.00,
      oldPrice: 890.00,
      rating: {
        rating: 4.8,
        rating_count: 19,
        reviews_count: 3,
        rating_detailes: [5,4,7,2,1]
      },
      inStock: 0,
      content: `
      <p>Гидрогелевая маска Gold & Snail от Petitfee - это инновационный уход за кожей, который сочетает в себе уникальные свойства улиточного муцина и коллоидного золота. Эта маска содержит 30 мл питательной и увлажняющей сыворотки, которая помогает улучшить тон кожи, повысить ее упругость и эластичность, а также сократить появление мелких морщин и линий.</p>
      <p>Улиточный муцин является богатым источником гиалуроновой кислоты, коллагена и эластина, которые помогают улучшить текстуру кожи, повысить ее упругость и эластичность, а также стимулировать процесс регенерации клеток. Коллоидное золото, в свою очередь, обладает антиоксидантными свойствами, защищая кожу от свободных радикалов и замедляя процесс старения.</p>
      <p>Гидрогелевая маска Gold & Snail имеет удобную форму, которая плотно прилегает к коже, обеспечивая максимальный контакт и эффективное проникновение активных компонентов в глубокие слои эпидермиса. Эта маска идеально подходит для всех типов кожи, особенно для тусклой, сухой и поврежденной кожи, которой требуется интенсивный уход и увлажнение.</p>`,
      category: {
        id: 1,
        name: "Акции",
        slug: '/shop/fsdfsdf'
      }
    },{
      id: 1,
      name: 'Гидрогелевая маска Gold & Snail, Petitfee, с улиточным муцином и коллоидным золотом, 30 мл',
      slug: '/fsdfwe',
      image: {
        src: '/images/products/5.png'
      },
      price: 869.50,
      oldPrice: 890.00,
      rating: {
        rating: 4.8,
        rating_count: 19,
        reviews_count: 3,
        rating_detailes: [5,4,7,2,1]
      },
      inStock: 5,
      content: `
      <p>Гидрогелевая маска Gold & Snail от Petitfee - это инновационный уход за кожей, который сочетает в себе уникальные свойства улиточного муцина и коллоидного золота. Эта маска содержит 30 мл питательной и увлажняющей сыворотки, которая помогает улучшить тон кожи, повысить ее упругость и эластичность, а также сократить появление мелких морщин и линий.</p>
      <p>Улиточный муцин является богатым источником гиалуроновой кислоты, коллагена и эластина, которые помогают улучшить текстуру кожи, повысить ее упругость и эластичность, а также стимулировать процесс регенерации клеток. Коллоидное золото, в свою очередь, обладает антиоксидантными свойствами, защищая кожу от свободных радикалов и замедляя процесс старения.</p>
      <p>Гидрогелевая маска Gold & Snail имеет удобную форму, которая плотно прилегает к коже, обеспечивая максимальный контакт и эффективное проникновение активных компонентов в глубокие слои эпидермиса. Эта маска идеально подходит для всех типов кожи, особенно для тусклой, сухой и поврежденной кожи, которой требуется интенсивный уход и увлажнение.</p>`,
      category: {
        id: 1,
        name: "Акции",
        slug: '/shop/fsdfsdf'
      }
    },{
      id: 2,
      name: 'Жидкий йод (йодид калия) "Liquid Iodine Plus" Life-flo, 150 мкг, 59 мл',
      slug: '/vcxvzx',
      image: {
        src: '/images/products/6.png'
      },
      price: 1769.00,
      oldPrice: 890.00,
      rating: {
        rating: 4.8,
        rating_count: 19,
        reviews_count: 3,
        rating_detailes: [5,4,7,2,1]
      },
      inStock: 5,
      content: `
      <p>Гидрогелевая маска Gold & Snail от Petitfee - это инновационный уход за кожей, который сочетает в себе уникальные свойства улиточного муцина и коллоидного золота. Эта маска содержит 30 мл питательной и увлажняющей сыворотки, которая помогает улучшить тон кожи, повысить ее упругость и эластичность, а также сократить появление мелких морщин и линий.</p>
      <p>Улиточный муцин является богатым источником гиалуроновой кислоты, коллагена и эластина, которые помогают улучшить текстуру кожи, повысить ее упругость и эластичность, а также стимулировать процесс регенерации клеток. Коллоидное золото, в свою очередь, обладает антиоксидантными свойствами, защищая кожу от свободных радикалов и замедляя процесс старения.</p>
      <p>Гидрогелевая маска Gold & Snail имеет удобную форму, которая плотно прилегает к коже, обеспечивая максимальный контакт и эффективное проникновение активных компонентов в глубокие слои эпидермиса. Эта маска идеально подходит для всех типов кожи, особенно для тусклой, сухой и поврежденной кожи, которой требуется интенсивный уход и увлажнение.</p>`,
      category: {
        id: 1,
        name: "Витамины и минералы",
        slug: '/shop/fsdfsdf'
      }
    },{
      id: 3,
      name: 'Пророщенные зерна, Добра їжа, измельченные пророщенные зерна, 300 г',
      slug: '/czxasv',
      image: {
        src: '/images/products/7.png'
      },
      price: 456.50,
      oldPrice: 890.00,
      rating: {
        rating: 4.8,
        rating_count: 19,
        reviews_count: 3,
        rating_detailes: [5,4,7,2,1]
      },
      inStock: 5,
      content: `
      <p>Гидрогелевая маска Gold & Snail от Petitfee - это инновационный уход за кожей, который сочетает в себе уникальные свойства улиточного муцина и коллоидного золота. Эта маска содержит 30 мл питательной и увлажняющей сыворотки, которая помогает улучшить тон кожи, повысить ее упругость и эластичность, а также сократить появление мелких морщин и линий.</p>
      <p>Улиточный муцин является богатым источником гиалуроновой кислоты, коллагена и эластина, которые помогают улучшить текстуру кожи, повысить ее упругость и эластичность, а также стимулировать процесс регенерации клеток. Коллоидное золото, в свою очередь, обладает антиоксидантными свойствами, защищая кожу от свободных радикалов и замедляя процесс старения.</p>
      <p>Гидрогелевая маска Gold & Snail имеет удобную форму, которая плотно прилегает к коже, обеспечивая максимальный контакт и эффективное проникновение активных компонентов в глубокие слои эпидермиса. Эта маска идеально подходит для всех типов кожи, особенно для тусклой, сухой и поврежденной кожи, которой требуется интенсивный уход и увлажнение.</p>`,
      category: {
        id: 1,
        name: "Акции",
        slug: '/shop/fsdfsdf'
      }
    },{
      id: 4,
      name: 'Гидрогелевая маска Gold & Snail, Petitfee, с улиточным муцином и коллоидным золотом, 30 мл',
      slug: '/kblvcblcv',
      image: {
        src: '/images/products/8.png'
      },
      price: 567.00,
      oldPrice: 890.00,
      rating: {
        rating: 4.8,
        rating_count: 19,
        reviews_count: 3,
        rating_detailes: [5,4,7,2,1]
      },
      inStock: 5,
      content: `
      <p>Гидрогелевая маска Gold & Snail от Petitfee - это инновационный уход за кожей, который сочетает в себе уникальные свойства улиточного муцина и коллоидного золота. Эта маска содержит 30 мл питательной и увлажняющей сыворотки, которая помогает улучшить тон кожи, повысить ее упругость и эластичность, а также сократить появление мелких морщин и линий.</p>
      <p>Улиточный муцин является богатым источником гиалуроновой кислоты, коллагена и эластина, которые помогают улучшить текстуру кожи, повысить ее упругость и эластичность, а также стимулировать процесс регенерации клеток. Коллоидное золото, в свою очередь, обладает антиоксидантными свойствами, защищая кожу от свободных радикалов и замедляя процесс старения.</p>
      <p>Гидрогелевая маска Gold & Snail имеет удобную форму, которая плотно прилегает к коже, обеспечивая максимальный контакт и эффективное проникновение активных компонентов в глубокие слои эпидермиса. Эта маска идеально подходит для всех типов кожи, особенно для тусклой, сухой и поврежденной кожи, которой требуется интенсивный уход и увлажнение.</p>`,
      category: {
        id: 1,
        name: "Акции",
        slug: '/shop/fsdfsdf'
      }
    }
  ] as Product []

  return (limit: number) => {
    return list.slice(0, limit)
  }
}


